docs/posts/publishing-a-website-in-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Samuel Evans-Powell</title>
<!-- 2018-03-16 Fri 16:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Samuel Evans-Powell" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Samuel Evans-Powell</h1>
<p>
<a id="top" name="top"></a>
<a href="../index.html">&lt; Home</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Publishing a Website in Org-Mode</h2>
<div class="outline-text-2" id="text-1">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Publishing a Website in Org-Mode</a>
<ul>
<li><a href="#sec-1-1">Getting started</a></li>
<li><a href="#sec-1-2">Generating Figures</a>
<ul>
<li><a href="#sec-1-2-1">Ditaa</a></li>
<li><a href="#sec-1-2-2">PlantUML</a></li>
</ul>
</li>
<li><a href="#sec-1-3">Navigation</a></li>
<li><a href="#sec-1-4">From here</a></li>
<li><a href="#sec-1-5">External links</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
Static site generators such as pelican [insert link] and Jekyll [? insert link]
allow you to write website content in plain text formats like Markdown and
quickly convert that content into webpages. You can do the same with org-mode!
All without leaving the safety of your Emacs application.
</p>

<p>
This guide is based off work by Bernt Hansen and his awesome org-mode post <a href="http://doc.norang.ca/org-mode.html#Publishing">here</a>,
with help from <a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html#Special-comment-section">this</a> org-mode tutorial. The <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Publishing.html">org-mode manual</a> is also very helpful
on this topic and is well worth a read.
</p>

<p>
This post won't be an introduction to Emacs [insert link] or <a href="http://spacemacs.org">Spacemacs</a>, and
since I'll be using <a href="http://spacemacs.org">Spacemacs</a>, instructions might be a little bit different if
you're using Emacs. 
</p>

<p>
This website is published using org-mode and can be found <a href="https://github.com/sevanspowell/sevanspowell">here</a>. My dotfiles
(including my .spacemacs file) can be found <a href="https://github.com/sevanspowell/dotfiles">here</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Getting started</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To get started, let's go ahead and create a website folder.
</p>

<pre class="example">
my-website/
   |- css/                     ;; We'll keep css files here 
   |  `- stylesheet.css        ;; Website stylesheet
   |- img/                     ;; We'll keep image files here
   `- index.org                ;; Our website homepage
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Generating Figures</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Ditaa</h4>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">PlantUML</h4>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Navigation</h3>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">From here</h3>
<div class="outline-text-3" id="text-1-4">
<p>
You can do many more awesome things with publishing in org-mode. I found looking
at the source files for the <a href="http://orgmode.org">org-mode website</a> extremely helpful (it's all
published using org!). You can find the source <a href="http://orgmode.org/worg/sources/">here</a> and a description of how the
website is published <a href="http://orgmode.org/worg/worg-setup.html">here</a>. 
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">External links</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="http://spacemacs.org">Spacemacs</a>
</li>
<li><a href="https://github.com/sevanspowell/sevanspowell">Site GitHub</a>
</li>
<li><a href="https://github.com/sevanspowell/dotfiles">My dotfiles</a>
</li>
<li><a href="http://orgmode.org/worg/index.html">Helpful Org-mode site</a>
</li>
<li><a href="http://doc.norang.ca/org-mode.html#Publishing">Norang publishing tutorial</a>
</li>
<li><a href="http://orgmode.org/worg/sources/">Org-mode site source</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Evans-Powell</p>
<p class="date">Created: 2018-03-16 Fri 16:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
